# Главное меню
#
# === Добро пожаловать в "Не магазин" ===
#
# Здесь вы можете обменивать тикеты для того, чтобы приобретать товары
#
# Для взаимодействия используйте команды:
#
# > Товары
# > Зарегистрироваться
# > Войти
#
#
# Меню Товары
#
# ID
# Стоимость
# Кол-во
# Название
#
# ID
# Стоимость
# Кол-во
# Название
#
#
# Меню зарегистрироваться
#
# Введите логин >
# Введите пароль >
#
#
# Меню Вход выполнен
#
# > Товары
# > Купить
# > Профиль
# > Тикет
#
# Меню Тикет
# > Тикет ebb94499-05c9-494f-9f4a-402c6543f244
# Вы успешно обменяли тикет на 20 поинтов!
# Теперь у вас - 20 поинтов
# Данный тикет уже был использован.
#
# Меню Покупка
#
# Купить 324 1
# Вы успешно купили "Игральные кости (белые)" в количестве: 1
# У вас осталось - 5 поинтов
#
# Меню Профиль
#
# === Igor ===
# Понитов: 5
#
# Заказы:
#
# Дата заказа
# Кол-во
# Сумма
# Название